microhal/microhal/microhal/ports/stm32f3xx/timer_stm32f3xx.h
    CR1_t CR1;
    CR2_t CR2;
    SMCR_t SMCR;
    uint32_t DIER;
    uint32_t SR;
    uint32_t EGR;    // event generation register
    CCMR1_t CCMR1;   // capture/compare mode register 1
    CCMR2_t CCMR2;   // capture/compare mode register 2
    CCER_t CCER;     // capture/compare enable register
    uint32_t CNT;    // counter
    uint32_t PSC;    // prescaler
    uint32_t ARR;    // auto-reload register
    uint32_t RCR;    // repetition counter register
    uint32_t CCR1;   // capture/compare register 1
    uint32_t CCR2;   // capture/compare register 2
    uint32_t CCR3;   // capture/compare register 3
    uint32_t CCR4;   // capture/compare register 4
    uint32_t BDTR;   // break and dead-time register
    uint32_t DCR;    // DMA control register
    uint32_t DMAR;   // DMA address for full transfer
    uint32_t OR;     // option registers
    uint32_t CCMR3;  // capture/compare mode register 3
    uint32_t CCR5;   // capture/compare register 5
    uint32_t CCR6;   // capture/compare register 6
};

namespace timer_detail {
enum class Interrupt {
    Update = 0b0001,
    CaptureCompare1 = 0b0010,
    CaptureCompare2 = 0b0100,
    CaptureCompare3 = 0b1000,
    CaptureCompare4 = 0b0001'0000,
    COM = 0b0010'0000,
    Trigger = 0b0100'0000,
    Break = 0b1000'0000
};

constexpr Interrupt operator&(Interrupt a, Interrupt b) {
    return static_cast<Interrupt>(static_cast<uint32_t>(a) & static_cast<uint32_t>(b));
}

constexpr uint32_t operator&(uint32_t a, Interrupt b) {
    return a & static_cast<uint32_t>(b);
}
}  // namespace timer_detail

using timer_detail::operator&;

class Timer {
 public:
    enum class Direction { UpCounter = 0x0, DownCounter = 0x1 };
    enum class ClockSource { Internal, ETRPin };
    using Interrupt = timer_detail::Interrupt;

    Timer(void *addr)
        : timer(*static_cast<TimerRegisterMap *>(addr)),
          compare1(*static_cast<TimerRegisterMap *>(addr), 1),
          compare2(*static_cast<TimerRegisterMap *>(addr), 2),
          compare3(*static_cast<TimerRegisterMap *>(addr), 3),
          compare4(*static_cast<TimerRegisterMap *>(addr), 4) {
        ClockManager::enable(*static_cast<TIM_TypeDef *>(addr));
    }

    /**
     * @brief This function enable timer.
     */
    void enable() { timer.CR1.bitfield.CEN = 1; }
    /**
     * @brief This function disable timer.
     */
    void disable() { timer.CR1.bitfield.CEN = 0; }

    void enableInterupt() {
        NVIC_SetPriority(TIM1_CC_IRQn, 6);
        NVIC_ClearPendingIRQ(TIM1_CC_IRQn);
        NVIC_EnableIRQ(TIM1_CC_IRQn);
    }

    void enableInterrupts(Interrupt interrupt) { timer.DIER |= static_cast<uint32_t>(interrupt); }

    /**
     * @brief This function set timer direction.
     *
     * @param direction - new timer direction.
     */
    void setDirection(Direction direction) { timer.CR1.bitfield.DIR = static_cast<uint32_t>(direction); }
    /**
     * This function return current direction setting
     * @return Direction
     */
    Direction getDirection() { return static_cast<Direction>(timer.CR1.bitfield.DIR); }

    void enableAutoReload() { timer.CR1.bitfield.ARPE = 1; }
    void disableAutoReload() { timer.CR1.bitfield.ARPE = 0; }

    void setAutoReloadRegister(uint32_t value) { timer.ARR = value; }

    void setPrescaler(uint16_t prescaler) { timer.PSC = prescaler; }
    uint32_t getPrescaler() { return timer.PSC; }

    void setClockSource(ClockSource clockSource) {
        switch (clockSource) {
            case ClockSource::Internal:
                break;
            case ClockSource::ETRPin:
                timer.SMCR.bitfield.ETF = 0;
                timer.SMCR.bitfield.ETPS = 0;
                timer.SMCR.bitfield.ETP = 0;
                timer.SMCR.bitfield.ECE = 1;
                break;
        }
    }

    class OutputCompare {
     public:
        enum class Mode {
            Frozen = 0,  //! The comparison between the output compare register TIMx_CCRx and the counter TIMx_CNT has no effect on the outputs.(this
                         //! mode is used to generate a timing base).
            SetChannelToActiveOnMatch,    //! Set channel x to active level on match. OCxREF signal is forced high when the counter TIMx_CNT matches
                                          //! the capture/compare register
            SetChannelToInactiveOnMatch,  //! Set channel x to inactive level on match. OC1REF signal is forced low when the counter TIMx_CNT matches
                                          //! the capture/compare register x (TIMx_CCRx).
            Toggle,                       //! OCxREF toggles when TIMx_CNT=TIMx_CCRx
            ForceInactiveLevel,           //! OCxREF is forced low.
            ForceActiveLevel,             //! OCxREF is forced high.
            PWMMode1,  //! In upcounting, channel x is active as long as TIMx_CNT<TIMx_CCRx else inactive. In downcounting, channel x is inactive
                       //! (OCxREF=‘0’) as long as TIMx_CNT>TIMx_CCR1 else active (OCxREF=’1’).
            PWMMode2,  //! In upcounting, channel 1 is inactive as long as TIMx_CNT<TIMx_CCR1 else active. In downcounting, channel 1 is active as
                       //! long as TIMx_CNT>TIMx_CCR1 else inactive
            OnePulseMode1,
            OnePulseMode2,
            CombinedPWMMode1 = 0b1100,  //! OC1REF has the same behavior as in PWM mode 1. OC1REFC is the logical OR between OC1REF and OC2REF.
            CombinedPWMMode2,           //! OC1REF has the same behavior as in PWM mode 2. OC1REFC is the logical AND between OC1REF and OC2REF.
            AssymmetricPWMMode1,  //! OC1REF has the same behavior as in PWM mode 1. OC1REFC outputs OC1REF when the counter is counting up, OC2REF
                                  //! when it is counting down.
            AssymmetricPWMMode2   //! OC1REF has the same behavior as in PWM mode 2. OC1REFC outputs OC1REF when the counter is counting up, OC2REF
                                  //! when it is counting down.
        };

        enum class Polarity { ActiveHigh = 0, ActiveLow };

        void setValue(uint32_t value) {
            switch (compareChannelNumber) {
                case 1:
                    timer.CCR1 = value;
                    break;
                case 2:
                    timer.CCR2 = value;
                    break;
                case 3:
                    timer.CCR3 = value;
                    break;
                case 4:
                    timer.CCR4 = value;
                    break;
            }
        }
        uint32_t getValue() {
            switch (compareChannelNumber) {
                case 1:
                    return timer.CCR1;
                case 2:
                    return timer.CCR2;
                case 3:
                    return timer.CCR3;
                case 4:
                    return timer.CCR4;
            }
        }
        void enablePreload() {
            switch (compareChannelNumber) {
                case 1:
                    timer.CCMR1.raw |= 1 << 3;
                    break;
                case 2:
                    timer.CCMR1.raw |= 1 << 11;  // bitfieldOutput.OC2PE = 1;
                    break;
                case 3:
                    timer.CCMR2.raw |= 1 << 3;  // bitfieldOutput.OC3PE = 1;
                    break;
                case 4:
                    timer.CCMR2.raw |= 1 << 11;  // bitfieldOutput.OC4PE = 1;
                    break;
            }
        }
        void disablePreload() {
            switch (compareChannelNumber) {
                case 1:
                    timer.CCMR1.bitfieldOutput.OC1PE = 0;
                    break;
                case 2:
                    timer.CCMR1.bitfieldOutput.OC2PE = 0;
                    break;
                case 3:
                    timer.CCMR2.bitfieldOutput.OC3PE = 0;
                    break;
                case 4:
                    timer.CCMR2.bitfieldOutput.OC4PE = 0;
                    break;
            }
        }
        void setMode(Mode mode) {
            switch (compareChannelNumber) {
                case 1:
                    // timer.CCMR1.bitfieldOutput.CC1S = 0;  // configure compare as output
                    timer.CCMR1.setOC1M(static_cast<uint32_t>(mode));
                    break;
                case 2:
                    // timer.CCMR1.bitfieldOutput.CC2S = 0;  // configure compare as output
                    timer.CCMR1.setOC2M(static_cast<uint32_t>(mode));
                    break;
                case 3:
                    // timer.CCMR2.bitfieldOutput.CC3S = 0;  // configure compare as output
                    timer.CCMR2.setOC3M(static_cast<uint32_t>(mode));
                    break;
                case 4:
                    // timer.CCMR2.bitfieldOutput.CC4S = 0;  // configure compare as output
                    timer.CCMR2.setOC4M(static_cast<uint32_t>(mode));
                    break;
            }
        }
        void outputEnable(Polarity polarity) {
            switch (compareChannelNumber) {
                case 1:
                    timer.CCER.bitfield.CC1P = static_cast<uint32_t>(polarity);
                    timer.CCER.bitfield.CC1E = 1;  // enable
                    break;
                case 2:
                    timer.CCER.bitfield.CC2P = static_cast<uint32_t>(polarity);
                    timer.CCER.bitfield.CC2E = 1;  // enable
                    break;
                case 3:
                    timer.CCER.bitfield.CC3P = static_cast<uint32_t>(polarity);
                    timer.CCER.bitfield.CC3E = 1;  // enable
                    break;
                case 4:
                    timer.CCER.bitfield.CC4P = static_cast<uint32_t>(polarity);
                    timer.CCER.bitfield.CC4E = 1;  // enable
                    break;
            }
        }
        void complementaryOutputEnable(Polarity polarity) {
            switch (compareChannelNumber) {
                case 1:
                    timer.CCER.bitfield.CC1NP = static_cast<uint32_t>(polarity);
                    timer.CCER.bitfield.CC1NE = 1;  // enable
                    break;
                case 2:
                    timer.CCER.bitfield.CC2NP = static_cast<uint32_t>(polarity);
                    timer.CCER.bitfield.CC2NE = 1;  // enable
                    break;
                case 3:
                    timer.CCER.bitfield.CC3NP = static_cast<uint32_t>(polarity);
                    timer.CCER.bitfield.CC3NE = 1;  // enable
                    break;
            }
        }
        void outputDisable() {
            switch (compareChannelNumber) {
                case 1:
                    timer.CCER.bitfield.CC1E = 0;
                    break;
                case 2:
                    timer.CCER.bitfield.CC2E = 0;
                    break;
                case 3:
                    timer.CCER.bitfield.CC3E = 0;
                    break;
                case 4:
                    timer.CCER.bitfield.CC4E = 0;
                    break;
            }
        }
        void complementaryOutputDisable() {
            switch (compareChannelNumber) {
                case 1:
                    timer.CCER.bitfield.CC1NE = 0;
                    break;
                case 2:
                    timer.CCER.bitfield.CC2NE = 0;
                    break;
                case 3:
                    timer.CCER.bitfield.CC3NE = 0;
                    break;
            }
        }

     private:
        TimerRegisterMap &timer;
        uint_fast8_t compareChannelNumber;

        OutputCompare(TimerRegisterMap &timer, uint_fast8_t channel) : timer(timer), compareChannelNumber(channel) {}
        friend Timer;
    };

    void enableCompareOutputs() { timer.BDTR |= TIM_BDTR_MOE; }
    uint32_t getValue() { return timer.CNT; }
    void setValue(uint32_t value) { timer.CNT = value; }

    OutputCompare compare1;
    OutputCompare compare2;
    OutputCompare compare3;
    OutputCompare compare4;

 private:
    volatile TimerRegisterMap &timer;
};

}  // namespace stm32f3xx
}  // namespace microhal

#endif /* _MICROHAL_TIMER_STM32F3XX_H_ */
